Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes.AutoSizeOptions Property
 Gets or sets the auto size options that control the drawing sheet size. Setting this property will change the SizeDefinitionMode to AutoSize.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AutoSizeOptions AutoSizeOptions { get; set; }
Public Property AutoSizeOptions As AutoSizeOptions
	Get
	Set
Property Value
Type: AutoSizeOptions
See Also
Reference
LayoutAttributes Class
Tekla.Structures.Drawing Namespace